benchmarks/results/pairs/bun/grit-mixed-2.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/bench.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 40s max duration (incl. graceful stop):
              * mixed: 50 looping VUs for 30s (exec: mixed, gracefulStop: 10s)


running (01.0s), 50/50 VUs, 610 complete and 0 interrupted iterations
mixed   [   3% ] 50 VUs  01.0s/30s

running (02.0s), 50/50 VUs, 1154 complete and 0 interrupted iterations
mixed   [   7% ] 50 VUs  02.0s/30s

running (03.0s), 50/50 VUs, 1618 complete and 0 interrupted iterations
mixed   [  10% ] 50 VUs  03.0s/30s

running (04.0s), 50/50 VUs, 2220 complete and 0 interrupted iterations
mixed   [  13% ] 50 VUs  04.0s/30s

running (05.0s), 50/50 VUs, 2770 complete and 0 interrupted iterations
mixed   [  17% ] 50 VUs  05.0s/30s

running (06.0s), 50/50 VUs, 3433 complete and 0 interrupted iterations
mixed   [  20% ] 50 VUs  06.0s/30s

running (07.0s), 50/50 VUs, 4079 complete and 0 interrupted iterations
mixed   [  23% ] 50 VUs  07.0s/30s

running (08.0s), 50/50 VUs, 4694 complete and 0 interrupted iterations
mixed   [  27% ] 50 VUs  08.0s/30s

running (09.0s), 50/50 VUs, 5255 complete and 0 interrupted iterations
mixed   [  30% ] 50 VUs  09.0s/30s

running (10.0s), 50/50 VUs, 5962 complete and 0 interrupted iterations
mixed   [  33% ] 50 VUs  10.0s/30s

running (11.0s), 50/50 VUs, 6591 complete and 0 interrupted iterations
mixed   [  37% ] 50 VUs  11.0s/30s

running (12.0s), 50/50 VUs, 7252 complete and 0 interrupted iterations
mixed   [  40% ] 50 VUs  12.0s/30s

running (13.0s), 50/50 VUs, 7928 complete and 0 interrupted iterations
mixed   [  43% ] 50 VUs  13.0s/30s

running (14.0s), 50/50 VUs, 8506 complete and 0 interrupted iterations
mixed   [  47% ] 50 VUs  14.0s/30s

running (15.0s), 50/50 VUs, 9180 complete and 0 interrupted iterations
mixed   [  50% ] 50 VUs  15.0s/30s

running (16.0s), 50/50 VUs, 9747 complete and 0 interrupted iterations
mixed   [  53% ] 50 VUs  16.0s/30s

running (17.0s), 50/50 VUs, 10364 complete and 0 interrupted iterations
mixed   [  57% ] 50 VUs  17.0s/30s

running (18.0s), 50/50 VUs, 10953 complete and 0 interrupted iterations
mixed   [  60% ] 50 VUs  18.0s/30s

running (19.0s), 50/50 VUs, 11502 complete and 0 interrupted iterations
mixed   [  63% ] 50 VUs  19.0s/30s

running (20.0s), 50/50 VUs, 11991 complete and 0 interrupted iterations
mixed   [  67% ] 50 VUs  20.0s/30s

running (21.0s), 50/50 VUs, 12532 complete and 0 interrupted iterations
mixed   [  70% ] 50 VUs  21.0s/30s

running (22.0s), 50/50 VUs, 13129 complete and 0 interrupted iterations
mixed   [  73% ] 50 VUs  22.0s/30s

running (23.0s), 50/50 VUs, 13738 complete and 0 interrupted iterations
mixed   [  77% ] 50 VUs  23.0s/30s

running (24.0s), 50/50 VUs, 14244 complete and 0 interrupted iterations
mixed   [  80% ] 50 VUs  24.0s/30s

running (25.0s), 50/50 VUs, 14731 complete and 0 interrupted iterations
mixed   [  83% ] 50 VUs  25.0s/30s

running (26.0s), 50/50 VUs, 15232 complete and 0 interrupted iterations
mixed   [  87% ] 50 VUs  26.0s/30s

running (27.0s), 50/50 VUs, 15964 complete and 0 interrupted iterations
mixed   [  90% ] 50 VUs  27.0s/30s

running (28.0s), 50/50 VUs, 16541 complete and 0 interrupted iterations
mixed   [  93% ] 50 VUs  28.0s/30s

running (29.0s), 50/50 VUs, 17075 complete and 0 interrupted iterations
mixed   [  97% ] 50 VUs  29.0s/30s

running (30.0s), 50/50 VUs, 17579 complete and 0 interrupted iterations
mixed   [ 100% ] 50 VUs  30.0s/30s


  █ THRESHOLDS 

    failed_requests
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 35272   1173.613917/s
    checks_succeeded...: 100.00% 35272 out of 35272
    checks_failed......: 0.00%   0 out of 35272

    ✓ status ok
    ✓ has data

    CUSTOM
    failed_requests................: 0.00%  0 out of 17636
    ttfb...........................: avg=82.64ms min=755.57µs med=69.36ms max=505.28ms p(90)=165.33ms p(95)=200.32ms

    HTTP
    http_req_duration..............: avg=84.21ms min=881.43µs med=70.94ms max=542.6ms  p(90)=167.34ms p(95)=203.23ms
      { expected_response:true }...: avg=84.21ms min=881.43µs med=70.94ms max=542.6ms  p(90)=167.34ms p(95)=203.23ms
    http_req_failed................: 0.00%  0 out of 17636
    http_reqs......................: 17636  586.806958/s

    EXECUTION
    iteration_duration.............: avg=85.07ms min=1.11ms   med=71.7ms  max=542.83ms p(90)=168.47ms p(95)=204.15ms
    iterations.....................: 17636  586.806958/s
    vus............................: 50     min=50         max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 108 MB 3.6 MB/s
    data_sent......................: 3.0 MB 98 kB/s



running (30.1s), 00/50 VUs, 17636 complete and 0 interrupted iterations
mixed ✓ [ 100% ] 50 VUs  30s