benchmarks/results/pairs/bun/grit-show-1.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/bench.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 40s max duration (incl. graceful stop):
              * show: 50 looping VUs for 30s (exec: show, gracefulStop: 10s)


running (01.0s), 50/50 VUs, 5071 complete and 0 interrupted iterations
show   [   3% ] 50 VUs  01.0s/30s

running (02.0s), 50/50 VUs, 10588 complete and 0 interrupted iterations
show   [   7% ] 50 VUs  02.0s/30s

running (03.0s), 50/50 VUs, 16722 complete and 0 interrupted iterations
show   [  10% ] 50 VUs  03.0s/30s

running (04.0s), 50/50 VUs, 21522 complete and 0 interrupted iterations
show   [  13% ] 50 VUs  04.0s/30s

running (05.0s), 50/50 VUs, 24830 complete and 0 interrupted iterations
show   [  17% ] 50 VUs  05.0s/30s

running (06.0s), 50/50 VUs, 28322 complete and 0 interrupted iterations
show   [  20% ] 50 VUs  06.0s/30s

running (07.0s), 50/50 VUs, 31703 complete and 0 interrupted iterations
show   [  23% ] 50 VUs  07.0s/30s

running (08.0s), 50/50 VUs, 35631 complete and 0 interrupted iterations
show   [  27% ] 50 VUs  08.0s/30s

running (09.0s), 50/50 VUs, 39994 complete and 0 interrupted iterations
show   [  30% ] 50 VUs  09.0s/30s

running (10.0s), 50/50 VUs, 44824 complete and 0 interrupted iterations
show   [  33% ] 50 VUs  10.0s/30s

running (11.0s), 50/50 VUs, 51107 complete and 0 interrupted iterations
show   [  37% ] 50 VUs  11.0s/30s

running (12.0s), 50/50 VUs, 57691 complete and 0 interrupted iterations
show   [  40% ] 50 VUs  12.0s/30s

running (13.0s), 50/50 VUs, 64079 complete and 0 interrupted iterations
show   [  43% ] 50 VUs  13.0s/30s

running (14.0s), 50/50 VUs, 68960 complete and 0 interrupted iterations
show   [  47% ] 50 VUs  14.0s/30s

running (15.0s), 50/50 VUs, 75083 complete and 0 interrupted iterations
show   [  50% ] 50 VUs  15.0s/30s

running (16.0s), 50/50 VUs, 81621 complete and 0 interrupted iterations
show   [  53% ] 50 VUs  16.0s/30s

running (17.0s), 50/50 VUs, 88542 complete and 0 interrupted iterations
show   [  57% ] 50 VUs  17.0s/30s

running (18.0s), 50/50 VUs, 95023 complete and 0 interrupted iterations
show   [  60% ] 50 VUs  18.0s/30s

running (19.0s), 50/50 VUs, 101369 complete and 0 interrupted iterations
show   [  63% ] 50 VUs  19.0s/30s

running (20.0s), 50/50 VUs, 107190 complete and 0 interrupted iterations
show   [  67% ] 50 VUs  20.0s/30s

running (21.0s), 50/50 VUs, 114126 complete and 0 interrupted iterations
show   [  70% ] 50 VUs  21.0s/30s

running (22.0s), 50/50 VUs, 120402 complete and 0 interrupted iterations
show   [  73% ] 50 VUs  22.0s/30s

running (23.0s), 50/50 VUs, 127912 complete and 0 interrupted iterations
show   [  77% ] 50 VUs  23.0s/30s

running (24.0s), 50/50 VUs, 134219 complete and 0 interrupted iterations
show   [  80% ] 50 VUs  24.0s/30s

running (25.0s), 50/50 VUs, 140394 complete and 0 interrupted iterations
show   [  83% ] 50 VUs  25.0s/30s

running (26.0s), 50/50 VUs, 145199 complete and 0 interrupted iterations
show   [  87% ] 50 VUs  26.0s/30s

running (27.0s), 50/50 VUs, 150945 complete and 0 interrupted iterations
show   [  90% ] 50 VUs  27.0s/30s

running (28.0s), 50/50 VUs, 156396 complete and 0 interrupted iterations
show   [  93% ] 50 VUs  28.0s/30s

running (29.0s), 50/50 VUs, 160006 complete and 0 interrupted iterations
show   [  97% ] 50 VUs  29.0s/30s

running (30.0s), 50/50 VUs, 163053 complete and 0 interrupted iterations
show   [ 100% ] 50 VUs  30.0s/30s


  █ THRESHOLDS 

    failed_requests
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 326224  10862.755454/s
    checks_succeeded...: 100.00% 326224 out of 326224
    checks_failed......: 0.00%   0 out of 326224

    ✓ status ok
    ✓ has data

    CUSTOM
    failed_requests................: 0.00%  0 out of 163112
    ttfb...........................: avg=7.99ms min=354.79µs med=6.58ms max=78.71ms  p(90)=15.08ms p(95)=18.96ms

    HTTP
    http_req_duration..............: avg=8.34ms min=402.91µs med=6.84ms max=88.13ms  p(90)=15.7ms  p(95)=19.91ms
      { expected_response:true }...: avg=8.34ms min=402.91µs med=6.84ms max=88.13ms  p(90)=15.7ms  p(95)=19.91ms
    http_req_failed................: 0.00%  0 out of 163112
    http_reqs......................: 163112 5431.377727/s

    EXECUTION
    iteration_duration.............: avg=9.14ms min=683.25µs med=7.45ms max=102.06ms p(90)=17.07ms p(95)=21.68ms
    iterations.....................: 163112 5431.377727/s
    vus............................: 50     min=50          max=50
    vus_max........................: 50     min=50          max=50

    NETWORK
    data_received..................: 225 MB 7.5 MB/s
    data_sent......................: 29 MB  951 kB/s



running (30.0s), 00/50 VUs, 163112 complete and 0 interrupted iterations
show ✓ [ 100% ] 50 VUs  30s